; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
   room_4 room_3 - room
   yellow_door_1 - door
   green_ball_1 - ball
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (not (emptyhands)) (= ?room2 room_3) (and (agentinroom room_3) (not (= ?room1 room_3)))) (hold_1)) (when (and (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (not (locked yellow_door_1))) (hold_4)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_1) (when (and (objectinroom green_ball_1 room_3) (not (and (= ?obj green_ball_1) (= ?room room_3)))) (hold_2)) (hold_3) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (agentinroom room_3) (hold_1)) (when (or (and (= ?obj green_ball_1) (= ?room room_3)) (objectinroom green_ball_1 room_3)) (hold_2)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door yellow_door_1)) (and (locked yellow_door_1) (not (and (locked ?door) (= ?door yellow_door_1)))))) (hold_0)) (when (and (agentinroom room_4) (not (or (and (not (locked ?door)) (= ?door yellow_door_1)) (and (locked yellow_door_1) (not (and (locked ?door) (= ?door yellow_door_1))))))) (hold_4)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 grey_door_1 purple_door_2 - door
   yellow_box_1 green_box_2 yellow_box_2 purple_box_1 blue_box_1 green_box_1 - box
   yellow_ball_1 - ball
 )
 (:init (agentinroom room_2) (objectinroom purple_box_1 room_1) (objectinroom yellow_box_1 room_1) (objectinroom green_box_1 room_1) (objectinroom yellow_ball_1 room_2) (objectinroom blue_box_1 room_3) (objectinroom green_box_2 room_3) (objectinroom yellow_box_2 room_4) (objectinroom green_ball_1 room_4) (objectcolor purple_box_1 purpletype) (objectcolor yellow_box_1 yellowtype) (objectcolor green_box_1 greentype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_box_1 bluetype) (objectcolor green_box_2 greentype) (objectcolor yellow_box_2 yellowtype) (objectcolor green_ball_1 greentype) (objectcolor purple_door_1 purpletype) (objectcolor yellow_door_1 yellowtype) (objectcolor grey_door_1 greytype) (objectcolor purple_door_2 purpletype) (emptyhands) (locked purple_door_1) (locked yellow_door_1) (locked grey_door_1) (locked purple_door_2) (adjacentrooms room_2 room_1 purple_door_1) (adjacentrooms room_1 room_2 purple_door_1) (adjacentrooms room_3 room_1 yellow_door_1) (adjacentrooms room_1 room_3 yellow_door_1) (adjacentrooms room_4 room_2 grey_door_1) (adjacentrooms room_2 room_4 grey_door_1) (adjacentrooms room_4 room_3 purple_door_2) (adjacentrooms room_3 room_4 purple_door_2) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v yellowtype) (at_ ?v))) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor grey_door_1 room_2 room_4)
   added: (at_ grey_door_1)
   goals met: 0 of 6
2. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 0 of 6
3. (gotoroom room_2 room_4 grey_door_1)
   deleted: (agentinroom room_2) (at_ grey_door_1)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 6
4. (gotodoor purple_door_2 room_4 room_3)
   added: (at_ purple_door_2)
   goals met: 0 of 6
5. (toggle purple_door_2)
   deleted: (locked purple_door_2)
   goals met: 0 of 6
6. (gotoobject green_ball_1 room_4)
   deleted: (at_ purple_door_2)
   added: (at_ green_ball_1)
   goals met: 0 of 6
7. (pick green_ball_1 room_4)
   deleted: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_4)
   added: (carrying green_ball_1) (hold_1) (hold_3)
   goals met: 2 of 6
8. (gotoroom room_4 room_3 purple_door_2)
   deleted: (agentinroom room_4)
   added: (agentinroom room_3) (visited room_3)
   goals met: 2 of 6
9. (gotodoor yellow_door_1 room_3 room_1)
   added: (at_ yellow_door_1)
   goals met: 2 of 6
10. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   added: (hold_0)
   goals met: 3 of 6
11. (gotoempty)
   deleted: (at_ yellow_door_1)
   added: (at_ empty)
   goals met: 3 of 6
12. (drop green_ball_1 room_3)
   deleted: (carrying green_ball_1) (at_ empty)
   added: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_3) (hold_2)
   goals met: 4 of 6
13. (gotoroom room_3 room_4 purple_door_2)
   deleted: (agentinroom room_3) (at_ green_ball_1)
   added: (agentinroom room_4) (hold_4)
   goals met: 5 of 6
14. (gotoroom room_4 room_2 grey_door_1)
   deleted: (agentinroom room_4)
   added: (agentinroom room_2)
   goals met: 5 of 6
15. (gotoobject yellow_ball_1 room_2)
   added: (at_ yellow_ball_1)
   goals met: 6 of 6
